# CSE-221710305019-siddharth venkat

# Data cleansing 
- check how many rows and columns are there
- what are the columns names
- what are are the row labels

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot
import sklearn

In [2]:
df1=pd.read_table("https://raw.githubusercontent.com/Mounika-Kajjam/SummerInternship/master/data.csv",sep=";",header=None)
df1

                        0     1          2           3        4              5
0     2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1     2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
2     2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3     2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4     2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America
...                   ...   ...        ...         ...      ...            ...
1790  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1792  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1793  2018-01-01 23:59:36  read  country_7  2458153054  AdWords         Europe
1794  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

[1795 rows x 6 columns]

In [3]:
print("columns:",df1.shape[0],"Rows:",df1.shape[1])# coloumns

columns: 1795 Rows: 6

In [4]:
print("column names:",df1.columns)

column names: Int64Index([0, 1, 2, 3, 4, 5], dtype='int64')

- what type of data you have 
- In the data if you have observed are there any missing values(NaN)

In [5]:
df1.dtypes

0    object
1    object
2    object
3     int64
4    object
5    object
dtype: object

In [6]:
df1.isnull()

          0      1      2      3      4      5
0     False  False  False  False  False  False
1     False  False  False  False  False  False
2     False  False  False  False  False  False
3     False  False  False  False  False  False
4     False  False  False  False  False  False
...     ...    ...    ...    ...    ...    ...
1790  False  False  False  False  False  False
1791  False  False  False  False  False  False
1792  False  False  False  False  False  False
1793  False  False  False  False  False  False
1794  False  False  False  False  False  False

[1795 rows x 6 columns]

- print the datatype of each column
- For each data type how many columns are there
- Using describe function observe the different measures for numerical and categorical columns

In [24]:
df1.dtypes.value_counts()

object    5
int64     1
dtype: int64

In [12]:
df2=df1.select_dtypes(include=["object"])
df2.describe() # categorical data

                          0     1          2       4     5
count                  1795  1795       1795    1795  1795
unique                 1773     1          8       3     6
top     2018-01-01 03:10:36  read  country_2  Reddit  Asia
freq                      3  1795        462     949   667

In [14]:
df3=df1.select_dtypes(exclude=["object"])
df3.describe() numerical data

                  3
count  1.795000e+03
mean   2.458152e+09
std    5.183162e+02
min    2.458151e+09
25%    2.458152e+09
50%    2.458152e+09
75%    2.458153e+09
max    2.458153e+09

- Use the info function to get the detailed info of the dataframe
-  Check for the duplicate values in all the columns
-  Replace the value “South America” from country column with NaN and fill with mode of   the column
- Check the count of categories being repeated in the source column.

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1795 entries, 0 to 1794
Data columns (total 6 columns):
0    1795 non-null object
1    1795 non-null object
2    1795 non-null object
3    1795 non-null int64
4    1795 non-null object
5    1795 non-null object
dtypes: int64(1), object(5)
memory usage: 84.3+ KB

In [16]:
df1.info

<bound method DataFrame.info of                         0     1          2           3        4              5
0     2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1     2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
2     2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3     2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4     2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America
...                   ...   ...        ...         ...      ...            ...
1790  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1792  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1793  2018-01-01 23:59:36  read  country_7  2458153054  AdWords         Europe
1794  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

[1795 rows x 6 columns]>

In [26]:
df7=df1.duplicated()
df7

0       False
1       False
2       False
3       False
4       False
        ...
1790    False
1791    False
1792    False
1793    False
1794    False
Length: 1795, dtype: bool

In [20]:
df5=df1.replace({5:"South America"},np.nan)
df5

                        0     1          2           3        4              5
0     2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1     2018-01-01 00:03:20  read  country_7  2458151262      SEO            NaN
2     2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3     2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4     2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America
...                   ...   ...        ...         ...      ...            ...
1790  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1792  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1793  2018-01-01 23:59:36  read  country_7  2458153054  AdWords         Europe
1794  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

[1795 rows x 6 columns]

In [30]:
df7.value_counts(False)

False    1795
dtype: int64